import pytest

from src.masks import get_mask_card_number, get_mask_account




@pytest.mark.parametrize(
                         "card_number, expected",
                         [
                             ("1596837868705199", "1596 83** **** 5199"),
                             ("1234567890123456", "1234 56** **** 3456"),
                             ("7000792289606361", "7000 79** **** 6361"),
                             ("5734895775397395", "5734 89** **** 7395"),
                             ("6427862748509858", "6427 86** **** 9858"),
                             ("", "Неверный тип данных"),
                             ("15968378", "Неверный тип данных"),
                             ("642786274850985878077835", "Неверный тип данных"),
                             ("573489dddd5397395", "Неверный тип данных")
                         ])

def test_get_mask_card_number(card_number, expected):
    """Проверка правильности маскировки, ответ функции на различные длины и отсутствие номера"""

    assert get_mask_card_number(card_number) == expected


@pytest.mark.parametrize(
                         "account_number, expected",
                         [
                             ("64686473678894779589", "**9589"),
                             ("", "Неверный тип данных"),
                             ("6468", "Неверный тип данных"),
                             ("646864736788947795897538548739573", "Неверный тип данных"),
                             ("573489dddd539773547539578395", "Неверный тип данных")
                         ])

def test_get_mask_account(account_number, expected):
    """Проверка правильности маскировки, ответ функции на различные длины и отсутствие номера"""
    assert get_mask_account(account_number) == expected


